onviflibs/gsoap/gsoap-2.8/gsoap/samples/link++/t.gmt.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:t="http://tempuri.org/t.xsd">
 <SOAP-ENV:Body>
  <t:gmt>
  </t:gmt>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
